In [1]:
# DataFrame : Serilerin birleştirilmiş halidir.
# Yani serilerin yan yana gelmesinden oluşturulmuş bir excel tablosudur.
import numpy as np
import pandas as pd

In [6]:
data = np.random.randn(4,3)

In [7]:
data # numpy dizisi matrix olarak 2 boyutlu oldu.

array([[-0.1281538 ,  0.66807543,  0.76083844],
       [ 0.50602167, -1.80358767,  0.08065341],
       [-0.37820821,  0.00284235,  1.19801918],
       [ 1.56955291, -1.12171784,  1.16636187]])

In [8]:
dataFrame = pd.DataFrame(data)

In [9]:
dataFrame # Artık yukarıdaki datayı sanki bir excel gibi kopyaladı.

          0         1         2
0 -0.128154  0.668075  0.760838
1  0.506022 -1.803588  0.080653
2 -0.378208  0.002842  1.198019
3  1.569553 -1.121718  1.166362

In [10]:
dataFrame[0] # 0. kolonu karşımıza getirir.

0   -0.128154
1    0.506022
2   -0.378208
3    1.569553
Name: 0, dtype: float64

In [11]:
type(dataFrame[0])

pandas.core.series.Series

In [12]:
yeniDataFrame = pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns=["Maas","Yas","Calisma Saati"])

In [13]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.128154  0.668075       0.760838
Zeynep  0.506022 -1.803588       0.080653
Atlas  -0.378208  0.002842       1.198019
Mehmet  1.569553 -1.121718       1.166362

In [17]:
yeniDataFrame["Yas"]

Atil      0.668075
Zeynep   -1.803588
Atlas     0.002842
Mehmet   -1.121718
Name: Yas, dtype: float64

In [18]:
yeniDataFrame["Yas"]["Atil"]

0.6680754269329832

In [24]:
yeniDataFrame["Maas"]["Zeynep"]

0.5060216716447146

In [28]:
yeniDataFrame[["Maas","Calisma Saati"]]

            Maas  Calisma Saati
Atil   -0.128154       0.760838
Zeynep  0.506022       0.080653
Atlas  -0.378208       1.198019
Mehmet  1.569553       1.166362

In [29]:
# yeniDataFrame["Atil"] yazınca çalışmaz, hata verir. Çünkü öyle bir column yok.
# yeniDataFrame["Atil"] diyince böyle bir kolon var mı diye arar. Eğer öncelikle rowu seçmek istersek şöyle bir şey yapmalıyız:
yeniDataFrame.loc["Atil"] # Atıl'a ait değerleri bir seri olarak karşımıza getirir.

Maas            -0.128154
Yas              0.668075
Calisma Saati    0.760838
Name: Atil, dtype: float64

In [30]:
yeniDataFrame.loc["Atil"]["Yas"]

0.6680754269329832

In [31]:
# index bazlı lokasyon yapmak için :
yeniDataFrame.iloc[1]

Maas             0.506022
Yas             -1.803588
Calisma Saati    0.080653
Name: Zeynep, dtype: float64

In [32]:
yeniDataFrame.loc["Zeynep"]

Maas             0.506022
Yas             -1.803588
Calisma Saati    0.080653
Name: Zeynep, dtype: float64

In [33]:
yeniDataFrame.loc[["Zeynep","Atil"]]

            Maas       Yas  Calisma Saati
Zeynep  0.506022 -1.803588       0.080653
Atil   -0.128154  0.668075       0.760838

In [34]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.128154  0.668075       0.760838
Zeynep  0.506022 -1.803588       0.080653
Atlas  -0.378208  0.002842       1.198019
Mehmet  1.569553 -1.121718       1.166362

In [36]:
# Diyelim ki DataFrame'i oluşturduk fakat yeni bir kolon eklemek istiyorum :
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [38]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -0.128154  0.668075       0.760838        1.336151
Zeynep  0.506022 -1.803588       0.080653       -3.607175
Atlas  -0.378208  0.002842       1.198019        0.005685
Mehmet  1.569553 -1.121718       1.166362       -2.243436

In [40]:
# yeniDataFrame.drop("Emeklilik Yasi") diyince çalışmaz. Çünkü bunu row'da aradı. O yüzden axis=1 diye belirtmen gerek.
# Yani kolon silmek istediğimizde axis=1 diye belirtmemiz gerek.
yeniDataFrame.drop("Emeklilik Yasi",axis=1)

            Maas       Yas  Calisma Saati
Atil   -0.128154  0.668075       0.760838
Zeynep  0.506022 -1.803588       0.080653
Atlas  -0.378208  0.002842       1.198019
Mehmet  1.569553 -1.121718       1.166362

In [41]:
# Row silmek istediğimizde axis=0 diye belirtebiliriz ya da belirtmesek de olur.
yeniDataFrame.drop("Mehmet")

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -0.128154  0.668075       0.760838        1.336151
Zeynep  0.506022 -1.803588       0.080653       -3.607175
Atlas  -0.378208  0.002842       1.198019        0.005685

In [42]:
yeniDataFrame.drop("Mehmet", axis=0)

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -0.128154  0.668075       0.760838        1.336151
Zeynep  0.506022 -1.803588       0.080653       -3.607175
Atlas  -0.378208  0.002842       1.198019        0.005685

In [43]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -0.128154  0.668075       0.760838        1.336151
Zeynep  0.506022 -1.803588       0.080653       -3.607175
Atlas  -0.378208  0.002842       1.198019        0.005685
Mehmet  1.569553 -1.121718       1.166362       -2.243436

In [44]:
# Eğer ki yaptığımız silme işlemini dataFrame üzerinde kayıt etmek istersek inplace = True demeliyiz.
yeniDataFrame.drop("Emeklilik Yasi", axis=1, inplace=True)

In [45]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.128154  0.668075       0.760838
Zeynep  0.506022 -1.803588       0.080653
Atlas  -0.378208  0.002842       1.198019
Mehmet  1.569553 -1.121718       1.166362

In [46]:
yeniDataFrame.loc["Atil"]

Maas            -0.128154
Yas              0.668075
Calisma Saati    0.760838
Name: Atil, dtype: float64

In [47]:
yeniDataFrame.loc["Atil"]["Yas"]

0.6680754269329832

In [48]:
yeniDataFrame.loc["Atil","Yas"]

0.6680754269329832

In [49]:
yeniDataFrame["Yas"].loc["Atil"]

0.6680754269329832

In [50]:
yeniDataFrame["Yas"]["Atil"]

0.6680754269329832

In [51]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.128154  0.668075       0.760838
Zeynep  0.506022 -1.803588       0.080653
Atlas  -0.378208  0.002842       1.198019
Mehmet  1.569553 -1.121718       1.166362

In [52]:
# 0'dan küçük olan değerleri bulmak istiyorsam :
yeniDataFrame < 0

         Maas    Yas  Calisma Saati
Atil     True  False          False
Zeynep  False   True          False
Atlas    True  False          False
Mehmet  False   True          False

In [53]:
yeniDataFrame[yeniDataFrame < 0]

            Maas       Yas  Calisma Saati
Atil   -0.128154       NaN            NaN
Zeynep       NaN -1.803588            NaN
Atlas  -0.378208       NaN            NaN
Mehmet       NaN -1.121718            NaN

In [55]:
yeniDataFrame["Yas"] > 0

Atil       True
Zeynep    False
Atlas      True
Mehmet    False
Name: Yas, dtype: bool

In [56]:
# Burada sadece Yas kolonunda 0'dan büyük olan değerlere ait kişi bilgilerini karşımıza getirir.
yeniDataFrame[yeniDataFrame["Yas"] > 0]

           Maas       Yas  Calisma Saati
Atil  -0.128154  0.668075       0.760838
Atlas -0.378208  0.002842       1.198019

In [57]:
yeniDataFrame[yeniDataFrame > 0]

            Maas       Yas  Calisma Saati
Atil         NaN  0.668075       0.760838
Zeynep  0.506022       NaN       0.080653
Atlas        NaN  0.002842       1.198019
Mehmet  1.569553       NaN       1.166362

In [59]:
yeniDataFrame[yeniDataFrame["Calisma Saati"] < 0]

Empty DataFrame
Columns: [Maas, Yas, Calisma Saati]
Index: []

In [60]:
yeniDataFrame[yeniDataFrame["Calisma Saati"] > 0]

            Maas       Yas  Calisma Saati
Atil   -0.128154  0.668075       0.760838
Zeynep  0.506022 -1.803588       0.080653
Atlas  -0.378208  0.002842       1.198019
Mehmet  1.569553 -1.121718       1.166362

In [61]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.128154  0.668075       0.760838
Zeynep  0.506022 -1.803588       0.080653
Atlas  -0.378208  0.002842       1.198019
Mehmet  1.569553 -1.121718       1.166362

In [62]:
# .reset_index() metodu indexleri resetler. Bunu yaparken index diye ayrı bir kolon açıp bizim yadıklarımızı buraya atar.
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0    Atil -0.128154  0.668075       0.760838
1  Zeynep  0.506022 -1.803588       0.080653
2   Atlas -0.378208  0.002842       1.198019
3  Mehmet  1.569553 -1.121718       1.166362

In [63]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.128154  0.668075       0.760838
Zeynep  0.506022 -1.803588       0.080653
Atlas  -0.378208  0.002842       1.198019
Mehmet  1.569553 -1.121718       1.166362

In [64]:
yeniIndeksListesi = ["Ati","Zey","Atl","Meh"]

In [65]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi

In [66]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Atil   -0.128154  0.668075       0.760838         Ati
Zeynep  0.506022 -1.803588       0.080653         Zey
Atlas  -0.378208  0.002842       1.198019         Atl
Mehmet  1.569553 -1.121718       1.166362         Meh

In [68]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati         -0.128154  0.668075       0.760838
Zey          0.506022 -1.803588       0.080653
Atl         -0.378208  0.002842       1.198019
Meh          1.569553 -1.121718       1.166362

In [69]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Atil   -0.128154  0.668075       0.760838         Ati
Zeynep  0.506022 -1.803588       0.080653         Zey
Atlas  -0.378208  0.002842       1.198019         Atl
Mehmet  1.569553 -1.121718       1.166362         Meh

In [70]:
yeniDataFrame.set_index("Yeni Indeks", inplace=True)

In [71]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati         -0.128154  0.668075       0.760838
Zey          0.506022 -1.803588       0.080653
Atl         -0.378208  0.002842       1.198019
Meh          1.569553 -1.121718       1.166362

In [72]:
yeniDataFrame.loc["Ati"]

Maas            -0.128154
Yas              0.668075
Calisma Saati    0.760838
Name: Ati, dtype: float64

In [73]:
yeniDataFrame.loc["Ati"]["Maas"]

-0.12815379688783166

In [74]:
yeniDataFrame.loc["Ati","Maas"]

-0.12815379688783166

In [75]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [76]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [81]:
# zip : ilkIndeksler listesi ile icIndeksler listesini birleştirir, list() ile de tuple listesine çevirir.
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [82]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [83]:
# Tuple listesini MultiIndex'e çeviriyoruz:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [84]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [85]:
# pandas'dan türetilen bir MultiIndex objesi olduğunu görürüz:
type(birlesmisIndeks)

pandas.core.indexes.multi.MultiIndex

In [86]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [88]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [92]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [93]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [94]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [95]:
cizgiFilmDataFrame.loc["Simpson"]["Yas"]

Homer    40
Bart     10
Marge    30
Name: Yas, dtype: object

In [96]:
cizgiFilmDataFrame.loc["South Park"]

        Yas Meslek
Cartman   9      D
Kenny    10      E
Kyle     11      F

In [98]:
cizgiFilmDataFrame.loc["Simpson"].loc["Homer"]

Yas       40
Meslek     A
Name: Homer, dtype: object

In [99]:
cizgiFilmDataFrame.loc["Simpson","Homer"]

Yas       40
Meslek     A
Name: (Simpson, Homer), dtype: object

In [100]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [101]:
cizgiFilmDataFrame.index.names = ["Film Adı","Karakter Adı"]

In [102]:
cizgiFilmDataFrame

                        Yas Meslek
Film Adı   Karakter Adı
Simpson    Homer         40      A
           Bart          10      B
           Marge         30      C
South Park Cartman        9      D
           Kenny         10      E
           Kyle          11      F